scripts/load_tests/all.yaml
config:
  target: 'http://localhost:3000'
  ensure:
    p95: 5000
    maxErrorRate: 0
  phases:
    # 1 user to start
    # increase by 1 user arrival per second (1, 2, 3, etc) up to 10 for 10 secs
    - duration: 10
      arrivalRate: 1
      rampTo: 10
      name: "Warm up"
    # increase by 10 user arrivals per second (10, 20, 30, etc) up to 100 for 10 secs
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up"
scenarios:
  - flow:
    - get:
        url: "/trips/monthly"
    - get:
        url: "/trips/day_of_week"
    - get:
        url: "/trips/temperature"